app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---

    <h4>autor: <%= "#{User.find(@post.user_id).email}: " %></h4>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
<h2>Comments:</h2>
<% @post.comments.each do |comment| %>