app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", "12"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "fdjkgbdfidfiu"], ["created_at", Thu, 13 Feb 2014 10:51:33 UTC +00:00], ["post_id", 12], ["updated_at", Thu, 13 Feb 2014 10:51:33 UTC +00:00], ["user_id", 1]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = 11  [["user_id", 1], ["updated_at", Wed, 12 Feb 2014 13:35:56 UTC +00:00]]
---
  def create

    @post = current_user.posts.find(params[:post_id])

    @comment = Comment.create(comment_params.merge(:post => @post))
    @comment.save

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", "12"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 1], ["id", "2"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destroy
    @post = current_user.posts.find(params[:post_id])

    @comment = @post.comments.find(params[:id])
    @comment.destroy