app/controllers/posts_controller.rb

  def create
    @post =current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 12 Feb 2014 14:01:40 UTC +00:00], ["text", "tytyt"], ["title", "gfyjjk"], ["updated_at", Wed, 12 Feb 2014 14:01:40 UTC +00:00], ["user_id", 2]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["text", "Why do we need associations between models? Because they make common operations simpler and easier in your code. "], ["updated_at", Tue, 11 Feb 2014 12:36:17 UTC +00:00]]

  def find_post
    @post = current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", "12"]]